test-common/docs/AX-WS-Requests/FindInvoiceRule.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:dat="http://schemas.microsoft.com/dynamics/2010/01/datacontracts" xmlns:arr="http://schemas.microsoft.com/2003/10/Serialization/Arrays" xmlns:ser="http://schemas.microsoft.com/dynamics/2008/01/services" xmlns:quer="http://schemas.microsoft.com/dynamics/2006/02/documents/QueryCriteria">
   <soapenv:Header>
      <dat:CallContext>
         <dat:Company>SE02</dat:Company>
         <dat:Language>en-US</dat:Language>
         <dat:LogonAsUser>TRADEDOUBLER\ITG-AX_Test</dat:LogonAsUser>
      </dat:CallContext>
   </soapenv:Header>
   <soapenv:Body>
      <ser:MDS_ITGSalesInvRServiceFindRequest>
         <quer:QueryCriteria>
            <quer:CriteriaElement>
               <quer:DataSourceName>MDS_SalesInvoiceRule</quer:DataSourceName>
               <quer:FieldName>InvoiceRuleId</quer:FieldName>
               <quer:Operator>EQUAL</quer:Operator>
               <quer:Value1>{3f2504e0-4f89-11d3-9a0c-0305e82c3405}</quer:Value1>
            </quer:CriteriaElement>
         </quer:QueryCriteria>
      </ser:MDS_ITGSalesInvRServiceFindRequest>
   </soapenv:Body>
</soapenv:Envelope>